app/controllers/meeting_entries_controller.rb

  def index
    @meeting_entries = MeetingEntry.all
---
SELECT "meeting_entries".* FROM "meeting_entries"

  def new
    @meeting_entry = MeetingEntry.new
    @meetings = Meeting.all
---
SELECT "meetings".* FROM "meetings"

  def create
    @meeting_entry = MeetingEntry.new(meeting_entry_params)
    params[:temp].each do | di1,di2 |
    # チェックボックスにチェックがついている場合
      if di2== "1"
        # DBのtitleカラムにタイトルを格納し保存
        # @meeting_entry = MeetingEntry.new(meeting_id:di1)
        @meeting_entry = MeetingEntry.new(meeting_entry_params)
        @meeting_entry[:meeting_id] = di1
        @meeting_entry.save
      end

       # binding.pry
    end

    respond_to do |format|
      if @meeting_entry.save
        format.html { redirect_to @meeting_entry, notice: 'Meeting entry was successfully created.' }
        # format.html { redirect_to action: "complete", notice: 'Meeting entry was successfully created.' }
        format.json { render :show, status: :created, location: @meeting_entry }
      else
        @meetings = Meeting.all
---
INSERT INTO "meeting_entries" ("meeting_id", "family_name", "first_name", "family_kana", "first_kana", "phone", "email", "purpose", "note", "agreement", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "meeting_entries" ("family_name", "first_name", "family_kana", "first_kana", "phone", "email", "purpose", "note", "agreement", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "meetings".* FROM "meetings"

    def set_meeting_entry
      @meeting_entry = MeetingEntry.find(params[:id])
---
SELECT  "meeting_entries".* FROM "meeting_entries" WHERE "meeting_entries"."id" = ? LIMIT ?  [["id", 52], ["LIMIT", 1]]