app/controllers/questions_controller.rb

  def index
    @questions = Question.all
---
SELECT "questions".* FROM "questions"

  def create
    @question = Question.new(question_params)

    respond_to do |format|
      if @question.save
---
INSERT INTO "questions" ("family_name", "first_name", "family_kana", "first_kana", "phone", "email", "content", "agreement", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @question.update(question_params)
---
UPDATE "questions" SET "family_name" = ?, "email" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["family_name", "池田あ"], ["email", "masa@gmail.com"], ["updated_at", "2019-07-28 11:15:53.328362"], ["id", 6]]

  def destroy
    @question.destroy
---
DELETE FROM "questions" WHERE "questions"."id" = ?  [["id", 2]]

    def set_question
      @question = Question.find(params[:id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]